# Taps (Fuentes de paquetes)
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# --- SHELL & CORE ---
brew "zsh"                      # Tu shell principal actualizada
brew "git"
brew "stow"                     # Gestor de dotfiles

# --- RUNTIMES & LENGUAJES ---
brew "fnm"                      # Node.js manager (Rápido)
brew "uv"                       # Python manager (Rápido)

# --- EDITORES & TERMINAL ---
brew "neovim"
brew "tmux"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"

# --- UTILIDADES "MODERN UNIX" ---
brew "ripgrep"                  # Buscador de texto (grep rápido)
brew "fd"                       # Buscador de archivos (find rápido)
brew "fzf"                      # Buscador difuso
brew "zoxide"                   # Navegación inteligente (cd rápido)
brew "eza"                      # Listado de archivos (ls moderno)
brew "bat"                      # Visor de archivos (cat con alas)
brew "jq"                       # Procesador de JSON
brew "lazygit"                  # Cliente de Git para terminal

# --- ZSH PLUGINS (Instalados via Brew para limpieza) ---
brew "zsh-completions"          # Autocompletado extra (Docker, Git avanzado, etc)
brew "zsh-autosuggestions"      # Sugerencias grises mientras escribes
brew "zsh-syntax-highlighting"  # Colores en los comandos

# --- APLICACIONES GUI (Casks) ---
cask "alacritty"
cask "font-iosevka-nerd-font"   # Tu fuente elegida
cask "docker"