# Taps
tap "homebrew/bundle"
# En Linux, las fuentes se manejan diferente, pero dejamos el tap por si acaso
tap "homebrew/cask-fonts" if OS.mac?

# --- CORE (Común en ambos) ---
brew "zsh"
brew "git"
brew "stow"
brew "fnm"
brew "uv"
brew "neovim"
brew "tmux"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "zoxide"
brew "eza"
brew "bat"
brew "jq"
brew "lazygit"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"

# Plugins Zsh (Común)
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# --- SOLO MACOS (Casks & Apps Gráficas) ---
if OS.mac?
    cask "alacritty"
    cask "font-iosevka-nerd-font"
    cask "docker"
end

# --- SOLO LINUX (Equivalentes si existen en brew core) ---
if OS.linux?
    # En Linux, Alacritty y Docker suelen instalarse mejor con apt/dnf/pacman
    # pero podemos intentar instalarlos si están en las fórmulas de linuxbrew
    brew "gcc" # A veces necesario para compilar nvim plugins
end